<template>
  <h1 class="text-center my-5">About Me</h1>
  <div class="row justify-content-center mb-5">
    <div class="col-10 col-md-8 col-xl-5">
      <p>
        我是張師竹，畢業於國立交通大學外國語文學系，畢業後運用英文專長前後進入貿易公司及軟體公司服務。在軟體公司服務期間，因為是新創公司，所以常常會需要自己找方法找工具解決，除了成功替公司找到最佳工具外，也訓練了我搜尋的速度與精準度，同時培養了凡事找方法，不要埋頭苦幹的思維。在職期間也廣泛接觸了各種領域，從多國語言行銷佈局、SEO、數位簽章、各國相關軟體競品分析，到實際產品功能規劃、UIUX介面設計、功能測試回饋，都是我有涉獵到的層面。雖然接觸到的東西很多，但能快速學習並進入狀況是我的優點，這個特質讓我能迅速適應變化快速的軟體業。
      </p>
      <p>
        <b># 為何轉職？</b>
      </p>
      <p>
        在上一份軟體業的工作跟工程師溝通的過程中，接觸到技術的層面，大致了解了前端工程的運作，進而萌生自己實作的想法，再考慮到之前工作經驗中，學習且運用到的技能廣而不深，好像什麼都碰過，卻什麼都不精，因此在基礎自學後，覺得這是個能長久發展的領域，於是決定把前端技術當成未來持續鑽研的專業技能，進而決定轉職，並參加了前端工程師的培訓。
      </p>
      <p>
        <b># 培訓過程</b>
      </p>
      <p>
        在前端工程師培訓中學習了核心的前端知識，並運用這些知識實作出購物網站、個人網頁、產品及企業實習等專案，從前端基礎HTML、CSS、JavaScript及框架Vue.js，和Bootstrap及Tailwind的使用，到後端Node.js的實作及串接API，讓我實際了解一個網站的開發流程。因為有上一份工作的經驗，遇到問題時我會很習慣的去找答案，也從搜尋並實作的過程中強化自己的實力，我也很喜歡和同學一起討論問題，能一起進步一起成長才能一起走得更遠。
      </p>
      <p>
        <b># 未來展望</b>
      </p>
      <p>
        業界的老師和朋友都說，軟體業更迭迅速，至少3-6個月就要學一門新技術，或許有些人會覺得要一直學新東西很麻煩，不願改變現有做法，但對我而言，一直持續學習新技術，讓自己站在前方，才能保有競爭力。未來規劃在熟悉前端領域後能跨足後端，並以全端工程師為目標，以更新的技術實作需求。
      </p>
    </div>
  </div>
</template>

<script>
export default {
    name: 'AboutView',
}
</script>

<style scoped>

</style>
